{
  "sections": [
    {
      "id": "I",
      "title": "Tổng quan về ý thức dân tộc",
      "paragraphs": [
        "Ý thức dân tộc là một hình thái ý thức xã hội phản ánh mối quan hệ giữa các cộng đồng dân tộc — được hình thành trong lịch sử — với bản sắc, lợi ích vật chất và tinh thần của chúng.",
        "Từ góc nhìn chủ nghĩa duy vật lịch sử, ý thức dân tộc không tồn tại độc lập với điều kiện kinh tế-xã hội; nó là sản phẩm phản ánh của tồn tại xã hội. Đây là tiền đề để phân tích cả vai trò tích cực và tiêu cực của nó."
      ]
    },
    {
      "id": "II",
      "title": "Hai mặt của ý thức dân tộc",
      "subsections": [
        {
          "subtitle": "Bản chất hai mặt",
          "paragraphs": [
            "Bản chất của ý thức dân tộc là một khái niệm phức tạp và mang tính hai mặt. Nó vừa là động lực đoàn kết mạnh mẽ, vừa có thể trở thành công cụ chính trị gây ra những hậu quả tiêu cực."
          ]
        },
        {
          "subtitle": "Ý thức dân tộc là động lực đoàn kết",
          "bullets": [
            "Kết nối mọi người trong một quốc gia, vượt qua khác biệt vùng miền, tôn giáo, tầng lớp.",
            "Tạo nên sự gắn kết: Lòng yêu nước chung là sợi dây vô hình kết nối hàng triệu trái tim.",
            "Thúc đẩy tinh thần hy sinh: sẵn sàng cống hiến vì lợi ích chung của Tổ quốc.",
            "Khơi dậy sức mạnh nội tại: tự lực, tự cường, phát triển kinh tế, văn hóa, khoa học.",
            "Tiến bộ khi gắn với giải phóng dân tộc, dân chủ hóa và phong trào vô sản quốc tế."
          ]
        },
        {
          "subtitle": "Ý thức dân tộc bị lợi dụng làm công cụ chính trị",
          "bullets": [
            "Lợi dụng quyền lực: kích động lòng tự tôn để che đậy yếu kém, tham nhũng, bất bình đẳng.",
            "Gây xung đột: trở thành chủ nghĩa dân tộc hẹp hòi, bài ngoại, dẫn đến chiến tranh phi lý.",
            "Thao túng quần chúng: tạo 'kẻ thù chung' để tập hợp và điều khiển vì lợi ích nhóm.",
            "Theo góc độ Mác-Lênin: đó là ý thức dân tộc phản động khi tách rời lợi ích nhân loại, đi ngược xu hướng lịch sử."
          ]
        }
      ]
    },
    {
      "id": "III",
      "title": "Quan điểm của chủ nghĩa duy vật lịch sử",
      "subsections": [
        {
          "subtitle": "Vai trò tích cực",
          "bullets": [
            "Phản ánh tồn tại xã hội (điều kiện kinh tế, chính trị, văn hóa cụ thể).",
            "Động lực của phong trào giải phóng dân tộc.",
            "Ngọn cờ quy tụ sức mạnh toàn dân chống xâm lược, giành độc lập.",
            "Yếu tố củng cố đoàn kết xã hội, tạo bản sắc văn hóa và tinh thần chung."
          ]
        },
        {
          "subtitle": "Giới hạn",
          "bullets": [
            "Không quyết định cuối cùng sự phát triển xã hội: tồn tại xã hội mới giữ vai trò quyết định.",
            "Dễ bị giai cấp thống trị biến thành công cụ chính trị.",
            "Nguy cơ bảo thủ, cô lập khi tuyệt đối hóa dân tộc, tách khỏi xu hướng tiến bộ chung."
          ]
        }
      ]
    }
  ]
}
